Revit 2024 API
FieldBuilder.NeedsUnits Method
 Checks whether the field type requires explicit unit conversions.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public bool NeedsUnits()
Visual Basic
Public Function NeedsUnits As Boolean
Visual C++
public:
bool NeedsUnits()
Return Value
 True if units are required.
See Also
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace